app/views/ballot/show.html.erb

    <ol id="ballot-list">
      <% @ballot.ballotEntries.each do |entry| %>
---
SELECT "ballot_entries".* FROM "ballot_entries"  WHERE "ballot_entries"."ballot_id" = ?  [["ballot_id", 2]]