app/views/elections/show.html.erb

SELECT  "candidates".* FROM "candidates"  WHERE "candidates"."election_id" = ?  ORDER BY "candidates"."id" ASC LIMIT 1  [["election_id", 49]]
---
    <ul>
      <% @election.candidates.each do |c| %>