app/controllers/ballot_controller.rb

    def create
        @ballotParams = params[:ballot]
        @election = Election.find(@ballotParams[:electionId])

        @entries = @ballotParams[:ballotEntries].split(",")
        if @entries.size == 0
            flash[:error] = "You must select at least one candidate"
            redirect_to @election and return
        end

        if @ballotParams[:voterName].empty?
            flash[:error] = "You must enter your name"
            redirect_to @election and return
        end


        @voter = Voter.new({ :name => @ballotParams[:voterName], :election => @election })
        @voter.save

        @ballot = Ballot.new({ :voter => @voter })
        @ballot.save



        @ballotParams[:ballotEntries].split(",").each_with_index do |candidateId, index|

            @candidate = Candidate.find(candidateId)
            if not @candidate.nil?
                @ballotEntry = BallotEntry.new({ :rank => index })
                @ballotEntry.save
---
SELECT  "elections".* FROM "elections"  WHERE "elections"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ballot_entries".* FROM "ballot_entries"  WHERE "ballot_entries"."ballot_id" = ?  [["ballot_id", 8]]
INSERT INTO "ballots" ("created_at", "updated_at", "voter_id") VALUES (?, ?, ?)  [["created_at", "2014-11-18 22:23:11.641995"], ["updated_at", "2014-11-18 22:23:11.641995"], ["voter_id", 3]]
INSERT INTO "voters" ("created_at", "election_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-18 22:23:11.633234"], ["election_id", 1], ["name", "Jason"], ["updated_at", "2014-11-18 22:23:11.633234"]]
SELECT  "candidates".* FROM "candidates"  WHERE "candidates"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "ballot_entries" ("ballot_id", "candidate_id", "created_at", "rank", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ballot_id", 9], ["candidate_id", 1], ["created_at", "2014-11-18 22:24:58.353260"], ["rank", 0], ["updated_at", "2014-11-18 22:24:58.353260"]]

    def show
        @ballot = Ballot.find(params[:id])
---
SELECT  "ballots".* FROM "ballots"  WHERE "ballots"."id" = ? LIMIT 1  [["id", 9]]

    def edit
        @ballot = Ballot.find(params[:id])
        @election = @ballot.voter.election

        @ballot.voter.destroy
---
SELECT  "ballots".* FROM "ballots"  WHERE "ballots"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "ballots" WHERE "ballots"."id" = ?  [["id", 6]]
DELETE FROM "voters" WHERE "voters"."id" = ?  [["id", 4]]