app/controllers/candidates_controller.rb

    def create
        @candidate_params = params[:candidates]
        @candidate_list = @candidate_params[:candidate_list].split()

        @success_candidates = Array.new
        @candidate_list.each do |candidate|
            @success_candidates << create_one(@candidate_params[:election_id], candidate)
        end
        redirect_to Election.find(@candidate_params[:election_id])
---
INSERT INTO "candidates" ("created_at", "election_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-14 00:17:02.099591"], ["election_id", 49], ["name", "a"], ["updated_at", "2014-11-14 00:17:02.099591"]]
SELECT  "elections".* FROM "elections"  WHERE "elections"."id" = ? LIMIT 1  [["id", 49]]