app/controllers/elections_controller.rb

INSERT INTO "elections" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-11 07:39:21.868387"], ["description", "world"], ["title", "hello"], ["updated_at", "2014-11-11 07:39:21.868387"]]
INSERT INTO "candidates" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-17 22:45:16.210971"], ["name", "hello"], ["updated_at", "2014-11-17 22:45:16.210971"]]
---
    def create
        @election = Election.new({:title => election_params[:title], :description => election_params[:description]})
        if not @election.save
            flash[:error] = "Cannot create election."
            render 'new' and return
        end

        @candidateList = election_params[:candidate_list].split()

        @successCandidate = Array.new
        @candidateList.each do |candidateName|
            @successCandidate << create_candidate(@election, candidateName)

SELECT  "elections".* FROM "elections"  WHERE "elections"."id" = ? LIMIT 1  [["id", 2]]
---
    def show
        @election = Election.find(params[:id])